<?php
//小说分类设置
$jieqiSort['article'][1] = array('group' => -1, 'code' => '', 'caption' => '玄幻魔法', 'types'=>array(101=>'东方玄幻', 102=>'西方奇幻', 103=>'异界大陆', 104=>'远古神话', 105=>'魔法校园', 106=>'领主贵族', 107=>'异类兽族'));

$jieqiSort['article'][2] = array('group' => -1, 'code' => '', 'caption' => '武侠修真', 'types'=>array(201=>'传统武侠', 202=>'浪子异侠', 203=>'国术武技', 204=>'古典仙侠', 205=>'奇幻修真', 206=>'现代修真', 207=>'洪荒封神'));

$jieqiSort['article'][3] = array('group' => -1, 'code' => '', 'caption' => '都市言情', 'types'=>array(301=>'都市生活', 302=>'恩怨情仇', 303=>'爱情婚姻', 304=>'异术超能', 305=>'青春校园', 306=>'商场职场', 307=>'娱乐明星', 308=>'乡土小说'));

$jieqiSort['article'][4] = array('group' => -1, 'code' => '', 'caption' => '历史军事', 'types'=>array(401=>'上古先秦', 402=>'秦汉三国', 403=>'唐宋元明', 404=>'清史民国', 405=>'军事战争', 406=>'战争幻想', 407=>'军旅生活'));

$jieqiSort['article'][5] = array('group' => -1, 'code' => '', 'caption' => '穿越架空', 'types'=>array(501=>'穿越时空', 502=>'古代言情', 503=>'总裁豪门', 504=>'架空历史'));

$jieqiSort['article'][6] = array('group' => -1, 'code' => '', 'caption' => '游戏竞技', 'types'=>array(601=>'游戏生涯', 602=>'虚拟网游', 603=>'游戏异界', 604=>'体育竞技'));

$jieqiSort['article'][7] = array('group' => -1, 'code' => '', 'caption' => '科幻灵异', 'types'=>array(701=>'未来世界', 702=>'星际战争', 703=>'古武机甲', 704=>'时空穿梭', 705=>'进化变异', 706=>'恐怖惊悚', 707=>'推理侦探', 708=>'悬疑探险'));

$jieqiSort['article'][8] = array('group' => -1, 'code' => '', 'caption' => '同人动漫', 'types'=>array(801=>'漫画同人', 802=>'游戏同人', 803=>'影视同人', 804=>'耽美小说'));

$jieqiSort['article'][9] = array('group' => -1, 'code' => '', 'caption' => '社会文学', 'types'=>array(901=>'娱乐时尚', 902=>'生活知识', 903=>'金融管理', 904=>'人物传记', 905=>'日记游记'));

$jieqiSort['article'][10] = array('group' => -1, 'code' => '', 'caption' => '综合其他', 'types'=>array(1001=>'短篇小说', 1002=>'诗词散文', 1003=>'其它小说'));

?>